[{"expTimeStarts": [], "expTimeEnds": [], "overviewPast": ["Bilingual Assessment Specialist", "Community Research Foundation", "Psychology Intern", "Aurora Behavioral Health", "Psychology Intern", "AIU Psychological &amp; Counseling Center"], "educationMajor1": "Clinical Psychology", "educationMajor2": "Clinical Psychology", "educationMajor3": "Psychology", "connections": [], "educationDegree2": "M.A.", "educationDegree3": "B.A.", "educationDegree1": "Psy.D.", "descriptionSummary": ["I am a CA and NY State Bilingual Licensed Psychologist who has been practicing psychotherapy for over 10 years. In my clinical experience, I have come to fully appreciate the curative power of a positive therapeutic relationship. My overarching goal is to make sure that people whom I work with feel valued, respected, and understood throughout the therapeutic process.", "Originally from the NYC area, I graduated from Trinity College in Hartford, CT with a B.A. in Psychology, concentrating on women’s issues and cultural identity. While at Trinity, I had the opportunity and good fortune to study abroad at the University of Buenos Aires in Argentina, and am fluent in Spanish. I earned my Psy.D. in Clinical Psychology from the California School of Professional Psychology (Alliant International University- San Diego campus) in 2009.", "My training and clinical experience has consisted of helping people of all ages -- adults, adolescents, children, and families -- cope with a wide range of problems. I have interned and trained at Children’s Hospital, Excelsior Academy, and Aurora Behavioral Health (psych hospital). In addition, I have worked at a university counseling center, outpatient mental health clinics, and an acute, residential, short term crisis house. I help people of all ages cope with mental health issues including, but not limited to, grief and loss, life transitions, academic and work related stress, low self esteem, and anxiety. In addition, I have been successful at helping adults cope with suicidal thinking, Schizophrenia, trauma, substance abuse, and depression."], "overviewEducation": ["Alliant International University-San Diego Cornerstone Court", "Trinity College-Hartford"], "summarySpecialties": [], "location": [], "educationSchoolName1": "Alliant International University-San Diego Scripps Ranch", "educationSchoolName3": "Trinity College-Hartford", "educationSchoolName2": "Alliant International University-San Diego Cornerstone Court", "eduTimeEnd1": "2009", "eduTimeEnd3": "1998", "eduTimeEnd2": "2008", "experienceHeads": [], "name": [], "url": "http://www.linkedin.com/pub/jennifer-joseph-psy-d/3/820/a0", "eduTimeStart3": "1994", "industry": [], "eduTimeStart1": "2001", "headlineTitle": [], "eduTimeStart2": "1999", "overviewCurrent": ["", "", "Bilingual Licensed Psychologist", "", ""]}]